/**
 *1)Поле breed не є універсальною властивістю всіх тварин.
 * Клас Animal є узагальненням, яке повинно містити лише спільні характеристики для всіх тварин (наприклад, name).
 * Не всі тварини мають породу, тому додавання breed в Animal буде недоречно
 * 2)== порівнює посилання на об’єкти, а equals() — їхні значення та вміст. Для Integer кешується у діапазоні від -128 до 127,
 * тому == може повертати true, але для порівняння потрібно використовувати equals().
 * 3)Upcasting є безпечним, оскільки об’єкт Dog завжди є Animal. Прямий downcasting без перевірки instanceof є небезпечним,
 * тому що якщо немає перевірки чи  Dog є Animal, під час виконання виникне ClassCastException.
 */